#include <stdio.h>

//一家农户以果园为生，
//一天， 父亲推出一车苹果，共252个， 准备分给他的6个儿子。
//父亲按事先写在一张纸上的数字把这堆苹果分完，每个人分到的苹果个数都不相同。
//他说:“老大，把你分到的苹果的1/8给老二，
//老二拿到后，连同原来的苹果分1/7给老三，
//老三拿到后，连同原来的苹果的1/6给老四，
//依此类推，最后老六拿到后，
//连同原来的苹果分1/3给老大，
//这样，你们每个人分到的苹果就一样多 了。”
//问兄弟6人原先各分到多少只苹果?
//x[1]=24
//x[2]=46
//x[3]=43
//x[4]=44
//x[5]=46
//x[6]=49
int main(void)
{
	int x[7] = {0};
	int y[7] = {0};
	int s = 0;
	int i = 0;
	
	s = 252 / 6;
	for (i=2; i<=6; i++)
	{
		y[i] = s * (9-i) / (8-i);
	}
	y[1] = x[1] = (s-y[6] / 3) * 8 / 7;
	for (i=2; i<=6; i++)
	{ 
		x[i]= y[i]-y[i-1]/(10-i);
	}
	for (i=1; i<=6;i++)
	{
		printf("x[%d]=%d\n", i, x[i]);
	}
	
	
	return  0;
}